app/Controllers/Home.php

SELECT *
FROM `users`
ORDER BY `id` DESC
 LIMIT 2, 2
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        //return view('home');
        echo view('/inc/header');
        $data['users'] = $this->user->orderby('id','DESC')->paginate(2);

INSERT INTO `users` (`username`, `email`) VALUES ('admin', 'harshalingannavar@gmail.com')
---
    public function saveUser(){
        $username = $this->request->getVar('username');
        $email = $this->request->getVar('email');
        $this ->user->save(["username"=>$username, "email"=>$email]);

SELECT *
FROM `users`
WHERE `id` = '22'
 LIMIT 1
---
    public function getSingleUser($id){
        $data = $this->user->where('id',$id)->first();

UPDATE `users` SET `username` = 'Vijaykkkk', `email` = 'vijaykyata2018@gmail.com'
WHERE `users`.`id` IN ('21')
---
    public function updateUser(){

        $id = $this->request->getVar('updateId');
        $username = $this->request->getVar('username');
        $email = $this->request->getVar('password');

        $data['username'] = $username;
        $data['email'] = $email;

        $this->user->update($id,$data);

DELETE FROM `users`
WHERE `id` IN ('22')
---
        public function deleteUser(){
            $id = $this->request->getVar('id');
           //echo $id; die();
            $this->user->delete($id);

DELETE FROM `users`
WHERE `id` IN ('21')
---
        public function deleteMultiUser(){
            $ids = $this->request->getVar('ids');
            for($count = 0;$count < count($ids);$count++){
                $this->user->delete($ids[$count]);